import HomeworkCard from '../components/HomeworkCard/HomeworkCard';
import styles from './Homeworks.module.scss';

import hw1 from '../assets/hw-1.jpg';
import hw2 from '../assets/hw-2.jpg';
import hw3 from '../assets/hw-2-1.jpg';

const Homeworks = () => {
  return (
    <div className={styles.container}>
      <h1>Домашні роботи 📚✏️</h1>
      <p className={styles.intro}>
        Вітаю у світі творчості та навчання! Тут зібрані всі мої домашні роботи
        — від перших кроків до складних викликів. Кожен урок — це нова пригода,
        і я дуже радію, що можу поділитись своїми досягненнями з тобою! 🚀✨
      </p>

      <div className={styles.grid}>
        <HomeworkCard
          lessonNumber={1}
          title="Піца-мрія художника"
          image={hw1}
          description="Перший смачний урок! 🍕 Тут я зобразила піцу, яка ніби щойно зійшла з фантазійної кухні італійського художника. Шматочки грибочків, веселенька ковбаска і грайливі оливки — кожен інгредієнт має свій характер. Цей малюнок – як гастрономічна картина, яку хочеться не тільки розглядати, а й скуштувати"
        />
        <HomeworkCard
          lessonNumber={2}
          title="Світанок над морем"
          image={hw2}
          description="Цей урок — про магію першого світла. У світанку я побачила не просто сонце, а початок нового дня, нових ідей і натхнення 🌞💫 Хвилі морського горизонту дихають спокоєм, а небо розцвітає ніжними кольорами — від персикового до золотого. Малюючи це, я ніби сама прокидалась разом із природою 🌊🌄"
        />
        <HomeworkCard
          lessonNumber={2}
          title="Сонце на тлі темного неба"
          image={hw3}
          description="А може це сонце, яке ніяк не хоче засинати? 🌇💭 У цьому малюнку я передала загадкову межу між світлом і темрявою. Воно ніби зависло між снами й дійсністю, не знаючи, прокидатись чи засинати... Така робота завжди залишає місце для уяви 🔮"
        />
      </div>
    </div>
  );
};

export default Homeworks;
